<?php
    /**
     * code.cls.php
     * 错误码
     * say
     * 2017-09-21 18:01:00
     */
    class code{
        public static $code = [
            //*预留 1-10
            //*框架
            //文件
            11 => '缺少核心类文件',
            12 => '缺少模式类文件',
            //运行
            21 => '必需使用cli启动服务',
            22 => 'shell命令错误',
            //*模式
            //simple
            101 => '缺少PHP扩展pcntl',
            102 => '缺少PHP扩展posix',
            111 => '启动子进程失败',
            112 => '共享内存打开失败',

            //*默认
            999 => '未知错误',
        ];
    }